{"inkVersion":20,"root":[["^As you both exit the tavern, you find yourselves in the middle of a small village. Gary steps before you and says, \"Let's start with the main market.\"","\n","^Gary leads you to one of the buildings on the main square, where the sound of metal hitting metal fills the air. \"This is the Smith's workshop. If you ever need your weapons fixed or sharpened, you just need to come here.\"","\n","^Approaching the smithy, you see the blacksmith crafting some kind of hatchet. Gary seems to gasp when you get close to the building.","\n",["ev",{"^->":"0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":18},{"s":["^\"What happened?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":18},{"s":["^\"You forgot something, didn't you?\"",{"->":"$r","var":true},null]}],["ev",{"^->":"0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-2","flg":18},{"s":["^Stay silent",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.6.s"},[{"#n":"$r2"}],"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.7.s"},[{"#n":"$r2"}],"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["ev",{"^->":"0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":"0.8.s"},[{"#n":"$r2"}],"\n","^\"I forgot about a package that needed to be delivered to the Smith. I'll need to go back and grab it after I show you around. Let's get going.\"","\n","^He then takes you to the next location.","\n","^\"This is the Main gate; if you need to exit the village, this is the way.","\n","^Next, I'll show you the pride of this village.","\n","^This is the old Oak tree, planted here when the village was founded.\"","\n","^As you move closer to the tree, you notice that the buildings here start to get much more expensive. Gary seems to see your reaction and says,","\n","^\"We're entering the rich district. Here you can see the holy temple of Lune. If you ever need help from the divine, this is the place.\"","\n","^\"That's everything, to be honest. It's not the biggest town, but it's ours. Let's get back to the Inn so I can deliver the things for the Smith. I'll tell you what, friend, I'm going to get my package from the tavern, and I'll meet you at the smithy. Good? Good. See you there.\"","\n","end",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}